Revit 2024 API
RevitLinkGraphicsSettings.LinkVisibilityType Property
 The visibility type of RevitLinkGraphicsSettings. If the type is set to ByHostView or ByLinkView, then the dependent properties of RevitLinkGraphicsSettings will be reset to their default state. The state of dependent properties can be changed later.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public LinkVisibility LinkVisibilityType { get; set; }
Visual Basic
Public Property LinkVisibilityType As LinkVisibility
	Get
	Set
Visual C++
public:
property LinkVisibility LinkVisibilityType {
	LinkVisibility get ();
	void set (LinkVisibility value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace